# Handing Missing Data

In [2]:
import numpy as np
import pandas as pd

In [5]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [6]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [7]:
# dropna默认丢弃任何含有缺失值的行
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how="all")  # 只丢弃全为NA的行ara

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = np.nan

In [12]:
data[4]

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(how="all", axis="columns")  # 丢弃列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0 -1.745808 -0.008017  0.202384
1 -2.468426  1.143420 -0.445597
2  0.874626 -0.318944 -0.190071
3 -0.422751 -0.372808 -0.302300
4 -0.150847  0.556375 -2.255751
5  0.114922  0.268605 -1.960679
6 -1.225488 -0.080146 -0.805679

In [14]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

In [15]:
df

          0         1         2
0 -1.745808       NaN       NaN
1 -2.468426       NaN       NaN
2  0.874626       NaN -0.190071
3 -0.422751       NaN -0.302300
4 -0.150847  0.556375 -2.255751
5  0.114922  0.268605 -1.960679
6 -1.225488 -0.080146 -0.805679

In [16]:
df.dropna()

          0         1         2
4 -0.150847  0.556375 -2.255751
5  0.114922  0.268605 -1.960679
6 -1.225488 -0.080146 -0.805679

In [18]:
df.dropna(thresh=2)  #至少有2个有效数据

          0         1         2
2  0.874626       NaN -0.190071
3 -0.422751       NaN -0.302300
4 -0.150847  0.556375 -2.255751
5  0.114922  0.268605 -1.960679
6 -1.225488 -0.080146 -0.805679

## Filling in Missing Data

In [19]:
df.fillna(0)

          0         1         2
0 -1.745808  0.000000  0.000000
1 -2.468426  0.000000  0.000000
2  0.874626  0.000000 -0.190071
3 -0.422751  0.000000 -0.302300
4 -0.150847  0.556375 -2.255751
5  0.114922  0.268605 -1.960679
6 -1.225488 -0.080146 -0.805679

In [20]:
df.fillna({1: 0.5, 2: 0})  # 第一列填充0.5，第二列填充0

          0         1         2
0 -1.745808  0.500000  0.000000
1 -2.468426  0.500000  0.000000
2  0.874626  0.500000 -0.190071
3 -0.422751  0.500000 -0.302300
4 -0.150847  0.556375 -2.255751
5  0.114922  0.268605 -1.960679
6 -1.225488 -0.080146 -0.805679

In [23]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.124042 -0.481598  0.671329
1 -1.934872 -1.511241  0.865721
2  0.605911       NaN  0.801533
3 -1.398491       NaN  0.732181
4  0.231998       NaN       NaN
5 -0.293843       NaN       NaN

In [24]:
df.fillna(method="ffill")

C:\Users\Irevin\AppData\Local\Temp\ipykernel_3956\4105657595.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.124042 -0.481598  0.671329
1 -1.934872 -1.511241  0.865721
2  0.605911 -1.511241  0.801533
3 -1.398491 -1.511241  0.732181
4  0.231998 -1.511241  0.732181
5 -0.293843 -1.511241  0.732181

In [25]:
df.fillna(method="bfill")

C:\Users\Irevin\AppData\Local\Temp\ipykernel_3956\1817864686.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

          0         1         2
0  0.124042 -0.481598  0.671329
1 -1.934872 -1.511241  0.865721
2  0.605911       NaN  0.801533
3 -1.398491       NaN  0.732181
4  0.231998       NaN       NaN
5 -0.293843       NaN       NaN

In [27]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [28]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing Duplicates

In [3]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [6]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [7]:
data.drop_duplicates(subset=["k1"])  # 默认保留第一个出现的组合

    k1  k2  v1
0  one   1   0
1  two   1   1

In [8]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [9]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon","pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [10]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [11]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [12]:
data["animal"]=data["food"].map(meat_to_animal)
data # map映射函数

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [13]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [15]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [17]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [18]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [19]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [4]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),index=["Ohio","Colorado","New York"],columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [3]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [5]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [6]:
data.rename(index=str.title,columns=str.upper) # 就地修改数据

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [7]:
data.rename(index={"OHIO":"INDIANA"},columns={"three":"peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [17]:
ages = [20,22,25,27,21,23,31,31,61,45,41,32]
bins =[18,25,36,60,100]

In [18]:
age_categories = pd.cut(ages,bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 36], (18, 25], ..., (25, 36], (60, 100], (36, 60], (36, 60], (25, 36]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 36] < (36, 60] < (60, 100]]

In [19]:
age_categories.codes # 数字编码，按label的顺序从0开始计数

array([0, 0, 0, 1, 0, 0, 1, 1, 3, 2, 2, 1], dtype=int8)

In [20]:
age_categories.categories

IntervalIndex([(18, 25], (25, 36], (36, 60], (60, 100]], dtype='interval[int64, right]')

In [21]:
pd.value_counts(age_categories)

C:\Users\Irevin\AppData\Local\Temp\ipykernel_10188\3004322060.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 36]     4
(36, 60]     2
(60, 100]    1
Name: count, dtype: int64

In [10]:
# 设定分箱名称 
group_names=["Youth","YoungAdult","MiddleAged","Senior"]
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [22]:
# 左开右闭 right=True 左闭右开 right=False
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 36), [25, 36), [18, 25), ..., [25, 36), [60, 100), [36, 60), [36, 60), [25, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 36) < [36, 60) < [60, 100)]

In [23]:
data = np.random.uniform(size=20)
pd.cut(data,4,precision=2) # 分成4个大小相等的箱，保留2位小数

[(0.047, 0.25], (0.45, 0.65], (0.047, 0.25], (0.65, 0.85], (0.45, 0.65], ..., (0.047, 0.25], (0.65, 0.85], (0.65, 0.85], (0.25, 0.45], (0.65, 0.85]]
Length: 20
Categories (4, interval[float64, right]): [(0.047, 0.25] < (0.25, 0.45] < (0.45, 0.65] < (0.65, 0.85]]

In [25]:
data=np.random.standard_normal(1000)
quartiles =pd.qcut(data,4,precision=2)
quartiles

[(0.69, 2.91], (0.69, 2.91], (-0.65, 0.042], (-3.1599999999999997, -0.65], (-0.65, 0.042], ..., (-0.65, 0.042], (0.69, 2.91], (0.69, 2.91], (0.69, 2.91], (0.042, 0.69]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.1599999999999997, -0.65] < (-0.65, 0.042] < (0.042, 0.69] < (0.69, 2.91]]

In [26]:
pd.qcut(data,[0,0.5,0.9,1.],precision=2).value_counts()

(-3.1599999999999997, 0.042]    500
(0.042, 1.25]                   400
(1.25, 2.91]                    100
Name: count, dtype: int64

## Detecting and Filtering Outliers

In [27]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data

            0         1         2         3
0   -0.774937 -0.024307  1.518373 -0.132052
1   -0.309197  0.285676 -2.161149  1.336632
2    0.687921  1.163263  0.282383 -0.453877
3   -1.316562  1.478140  1.005224 -0.330055
4   -1.121996  0.239792 -0.694641  0.674045
..        ...       ...       ...       ...
995 -1.169090  1.588259 -1.830114 -1.741186
996 -0.399394 -0.243469 -0.813797  2.230528
997  0.734483 -0.280900 -2.040743  1.501027
998  0.529170 -0.151706  0.781300  2.897894
999 -2.393905 -0.144840  0.556219 -1.713478

[1000 rows x 4 columns]

In [28]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014953    -0.030316    -0.041577    -0.024066
std       1.039683     0.964113     1.005380     1.015015
min      -3.388735    -3.073902    -3.120297    -3.587070
25%      -0.692446    -0.693852    -0.687482    -0.722686
50%      -0.046430    -0.036573    -0.054039    -0.008115
75%       0.716569     0.580262     0.649104     0.684011
max       3.668030     2.877385     3.000896     2.941029

In [29]:
col = data[2]
col

0      1.518373
1     -2.161149
2      0.282383
3      1.005224
4     -0.694641
         ...
995   -1.830114
996   -0.813797
997   -2.040743
998    0.781300
999    0.556219
Name: 2, Length: 1000, dtype: float64

In [30]:
col[col.abs()>3]

426    3.000896
466   -3.120297
Name: 2, dtype: float64

In [31]:
data[(data.abs()>3).any(axis="columns")] # 沿着列方向进行操作

            0         1         2         3
138 -2.004045 -0.702032  0.927389 -3.587070
188  1.211065 -3.073902 -0.276127 -0.219766
251  0.374413  0.085353 -0.598023 -3.149063
304  3.668030 -0.308772 -0.080467 -2.046035
352  3.066716  2.877385  0.436465 -1.961583
426  0.870224  1.060302  3.000896 -0.560466
466 -0.513178 -0.469614 -3.120297 -2.109318
588 -3.388735 -0.712497 -2.250796 -0.385704

In [34]:
c=data[data.abs()>3]=np.sign(data)*3

In [35]:
c

       0    1    2    3
0   -3.0 -3.0  3.0 -3.0
1   -3.0  3.0 -3.0  3.0
2    3.0  3.0  3.0 -3.0
3   -3.0  3.0  3.0 -3.0
4   -3.0  3.0 -3.0  3.0
..   ...  ...  ...  ...
995 -3.0  3.0 -3.0 -3.0
996 -3.0 -3.0 -3.0  3.0
997  3.0 -3.0 -3.0  3.0
998  3.0 -3.0  3.0  3.0
999 -3.0 -3.0  3.0 -3.0

[1000 rows x 4 columns]

## Permutation and Random Sampling

In [5]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [6]:
sampler = np.random.permutation(5)
sampler

array([4, 1, 2, 3, 0], dtype=int32)

In [7]:
df.take(sampler) # 类似于iloc 但是比iloc更底层

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [8]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [9]:
column_sampler = np.random.permutation(7)
column_sampler

array([4, 6, 2, 1, 3, 5, 0], dtype=int32)

In [11]:
df.take(column_sampler,axis="columns")

    4   6   2   1   3   5   0
0   4   6   2   1   3   5   0
1  11  13   9   8  10  12   7
2  18  20  16  15  17  19  14
3  25  27  23  22  24  26  21
4  32  34  30  29  31  33  28

In [12]:
df.sample(n=3) #随机抽取三行

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34

In [13]:
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10,replace=True)

0    5
4    4
0    5
2   -1
4    4
3    6
1    7
1    7
0    5
2   -1
dtype: int64

## Computing Indicator/Dummy Variables

In [14]:
df=pd.DataFrame({"key":["b","b","a","c","a","b"],"data1":range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [15]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [17]:
dummies=pd.get_dummies(df["key"],prefix="key")
dummies

   key_a  key_b  key_c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [19]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [21]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [22]:
dummies = movies["genres"].str.get_dummies(sep="|")
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [23]:
movies_windic = movies.join(dummies.add_prefix("genres_"))
movies_windic.iloc[0]

movie_id                                        1
title                            Toy Story (1995)
genres                Animation|Children's|Comedy
genres_Action                                   0
genres_Adventure                                0
genres_Animation                                1
genres_Children's                               1
genres_Comedy                                   1
genres_Crime                                    0
genres_Documentary                              0
genres_Drama                                    0
genres_Fantasy                                  0
genres_Film-Noir                                0
genres_Horror                                   0
genres_Musical                                  0
genres_Mystery                                  0
genres_Romance                                  0
genres_Sci-Fi                                   0
genres_Thriller                                 0
genres_War                                      0
genres_Western                                  0
Name: 0, dtype: object

In [24]:
# 先用cut进行binning,再转化为Dummy Variables，以便作为输入模型参数
np.random.seed(12345)
values= np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [25]:
bins=[0,0.2,0.4,0.6,0.8,1]
c = pd.cut(values,bins)

In [26]:
c

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64, right]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [27]:
pd.get_dummies(c)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

# Extension Data Types

In [28]:
s = pd.Series([1,2,3,None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [29]:
s.dtype

dtype('float64')

In [30]:
s =pd.Series([1,2,3,None],dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [31]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [32]:
s[3]

In [33]:
s[3] is pd.NA

True

# String Manipulation

In [38]:
val="a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [39]:
# split 和strip 一起使用，去除空白符
pieces =[x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [40]:
first,second,third = pieces

In [41]:
first+"::"+second+"::"+third

'a::b::guido'

In [42]:
"::".join(pieces)

'a::b::guido'

In [43]:
"guido" in val

True

In [48]:
val

'a,b,  guido'

In [ ]:
first+"::"+second+"::"+third

In [47]:
val.index("b")

2

In [45]:
val.find(":")

-1

In [49]:
val.count(",")

2

In [50]:
val.replace(",","::")

'a::b::  guido'

In [51]:
val.replace(",","")

'ab  guido'

## Regular Expression

感觉暂时用不到，不学了

# Categorical Data

## Background and Motivation

In [54]:
values = pd.Series(['apple','orange','apple','apple']*2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [55]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [56]:
pd.value_counts(values)

C:\Users\Irevin\AppData\Local\Temp\ipykernel_27448\3351397580.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

烂尾，看不太懂，遇到分类再回来学